Revit 2026 API

# ThermalAssetSpecificHeatOfVaporization Property

---

The specific heat of vaporization of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SpecificHeatOfVaporization { get; set; }
```
```vb
Public Property SpecificHeatOfVaporization As Double
	Get
	Set
```
```cpp
public:
property double SpecificHeatOfVaporization {
	double get ();
	void set (double value);
}
```
```fsharp
member SpecificHeatOfVaporization : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for specificHeatOfVaporization must be non-negative. |

Values are in feet per squared-second (ft/s²) and must be non-negative.

#### Reference

ThermalAsset Class

Autodesk.Revit.DB Namespace